In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
#Let's make a dframe
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

#Show
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555
1  X   beta -0.206215  0.001750
2  Y  alpha -1.022871 -0.688329
3  Y   beta -0.506143 -0.953063
4  Z  alpha  1.361366  1.549917

In [3]:
#Now let's see how to use groupby

#Lets grab the dataset1 column and group it by the k1 key
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
#Show the groupby object, will not see anything 
group1

In [6]:
#Now we can perform operations on this particular group
group1.mean()

k1
X    0.211958
Y   -0.764507
Z    1.361366
Name: dataset1, dtype: float64

In [8]:
# We can use group keys that are series as well

#For example:

#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])
#Now using the data from dataset1, group the means by city and month
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.206215
    JAN   -1.022871
NY  FEB   -0.506143
    JAN    0.995748
Name: dataset1, dtype: float64

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555
1  X   beta -0.206215  0.001750
2  Y  alpha -1.022871 -0.688329
3  Y   beta -0.506143 -0.953063
4  Z  alpha  1.361366  1.549917

In [10]:
# WE can also pass column names as group keys
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.211958  0.041153
Y  -0.764507 -0.820696
Z   1.361366  1.549917

In [11]:
# Or multiple column names
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.630131  0.080555
   beta  -0.206215  0.001750
Y  alpha -1.022871 -0.688329
   beta  -0.506143 -0.953063
Z  alpha  1.361366  1.549917

In [12]:
# Another useful groupby method is getting the group sizes
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [15]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name) #% to use the values to find in the missing word
    print (group)
    print ('\n') # print a new line

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555
1  X   beta -0.206215  0.001750


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.022871 -0.688329
3  Y   beta -0.506143 -0.953063


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.361366  1.549917

In [17]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555
1  X   beta -0.206215  0.001750


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.022871 -0.688329
3  Y   beta -0.506143 -0.953063


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.361366  1.549917

In [19]:
# We can also iterate with multiple keys
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print (group)
    print ('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -0.206215   0.00175


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -1.022871 -0.688329


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.506143 -0.953063


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.361366  1.549917

In [20]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(dframe.groupby('k1')))

#Show the group with X
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555
1  X   beta -0.206215  0.001750

In [21]:
# We could have also chosen to do this with axis = 1

# Let's creat a dictionary for dtypes of objects!
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

#show
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.630131  0.080555
 1 -0.206215  0.001750
 2 -1.022871 -0.688329
 3 -0.506143 -0.953063
 4  1.361366  1.549917, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [22]:
# Next we'll learn how to use groupby with columns
# For example if we only wanted to group the dataset2 column with both sets of keys
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.080555
   beta   0.001750
Y  alpha -0.688329
   beta  -0.953063
Z  alpha  1.549917

In [23]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.630131  0.080555
1  X   beta -0.206215  0.001750
2  Y  alpha -1.022871 -0.688329
3  Y   beta -0.506143 -0.953063
4  Z  alpha  1.361366  1.549917

In [ ]:
#Next we'll have a quick lesson on grouping with dictionaries and series!